### Manipulando dataframes
#### Selecionar linhas pelo indice
[(Utilizando pandas.DataFrame.loc)](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html#pandas-dataframe-loc) Acesse um grupo de linhas e colunas por rótulo(s) ou uma matriz booleana.

In [5]:
import pandas as pd

In [6]:
# Criando um dataframe
frame_data = {'nome'  : ['Berry', 'Kara', 'Clark'], 
              'idade' : [28, 32, 52], 
              'função': ['Office Boy', 'Enfermeira', 'Ascensorista']}

df = pd.DataFrame(frame_data)

In [7]:
print("Dataframe")
print(df)
print()

Dataframe
    nome  idade        função
0  Berry     28    Office Boy
1   Kara     32    Enfermeira
2  Clark     52  Ascensorista

#### O uso do loc[] é para índices do dataframe
À frente, será visto que também pode-se usar a forma de acesso do numby com ":"

In [8]:
print("Acessando por valor do indice, são retornadas todas as colunas da linha(índice) informado")
print(df.loc[0])
print()
print("Resultado exibido como: ",type(df.loc[0]))
print()
print(df.loc[[0]])
print("Resultado exibido como: ",type(df.loc[[0]]))
print()

print("Retornando mais de 1 registro baseando-se no indíce")
print(df.loc[[1,2]])

Acessando por valor do indice, são retornadas todas as colunas da linha(índice) informado
nome           Berry
idade             28
função    Office Boy
Name: 0, dtype: object

Resultado exibido como:  <class 'pandas.core.series.Series'>

    nome  idade      função
0  Berry     28  Office Boy
Resultado exibido como:  <class 'pandas.core.frame.DataFrame'>

Retornando mais de 1 registro baseando-se no indíce
    nome  idade        função
1   Kara     32    Enfermeira
2  Clark     52  Ascensorista

#### Acessando colunas diretamente (o resultado é uma pandas.series)

In [9]:
df['nome']

0    Berry
1     Kara
2    Clark
Name: nome, dtype: object

In [10]:
# semelhante ao anterior
df.nome

0    Berry
1     Kara
2    Clark
Name: nome, dtype: object

In [11]:
df['idade']

0    28
1    32
2    52
Name: idade, dtype: int64

In [12]:
# semelhante ao anterior
df.idade

0    28
1    32
2    52
Name: idade, dtype: int64

In [13]:
df['função']

0      Office Boy
1      Enfermeira
2    Ascensorista
Name: função, dtype: object

In [14]:
# semelhante ao anterior
df.função

0      Office Boy
1      Enfermeira
2    Ascensorista
Name: função, dtype: object

#### Acessando uma linha com base no valor

In [15]:
df.loc[df['nome'] == 'Kara']

   nome  idade      função
1  Kara     32  Enfermeira

In [16]:
df['nome'] == 'Kara'

0    False
1     True
2    False
Name: nome, dtype: bool

In [17]:
df.loc[df['função'] == 'Enfermeira']

   nome  idade      função
1  Kara     32  Enfermeira

In [18]:
df.loc[df['idade'] == 28]

    nome  idade      função
0  Berry     28  Office Boy

#### Utilizando a sintaxe de fatiamento podemos alcançar os mesmos resultado da utilização do .loc com índice
Fatiamento -> semelhante a loc[], **logo se utiliza de índices também**
<br>Após o ":" é o tamanho

In [19]:
df[0:3]

    nome  idade        função
0  Berry     28    Office Boy
1   Kara     32    Enfermeira
2  Clark     52  Ascensorista

In [20]:
df[0:]

    nome  idade        função
0  Berry     28    Office Boy
1   Kara     32    Enfermeira
2  Clark     52  Ascensorista

In [21]:
df['nome']

0    Berry
1     Kara
2    Clark
Name: nome, dtype: object

#### Aplicar funções em linhas / colunas
[Método Apply](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.apply.html#pandas-dataframe-apply) Aplique uma função ao longo de um eixo do DataFrame.<br>
Por padrão, a função é aplicada em todas as colunas. Para aplicar em linhas, utilize o parâmetro axis = 1

#### Raíz quadrada

In [22]:
# aplicar a raiz quadrada em todas as colunas(que sejam numericas)
## Criar dataframes
import numpy as np

frame_data = {'A': [1, 2, 3], 'B': [18, 20, 22], 'C': [54, 12, 13]}

df = pd.DataFrame(frame_data)

print(df)
print()

df.apply(np.sqrt)

   A   B   C
0  1  18  54
1  2  20  12
2  3  22  13

          A         B         C
0  1.000000  4.242641  7.348469
1  1.414214  4.472136  3.464102
2  1.732051  4.690416  3.605551

#### Aplicar soma

In [23]:

df.apply(np.sum)

A     6
B    60
C    79
dtype: int64

#### Classificar valores por linha/coluna
[Método sort_values](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html#pandas-dataframe-sort-values) Classifique pelos valores ao longo de cada eixo.

#### Classificando por coluna

In [24]:
frame_data = {'A': [23, 12, 30], 'B': [18, 20, 22], 'C': [54, 112, 13]}

df = pd.DataFrame(frame_data)

df.sort_values(by='A')

    A   B    C
1  12  20  112
0  23  18   54
2  30  22   13

In [25]:
f = pd.DataFrame({

    'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],

    'col2': [2, 1, 9, 8, 7, 4],

    'col3': [0, 1, 9, 4, 2, 3],

    'col4': ['a', 'B', 'c', 'D', 'e', 'F']

})

print(f)
print()

f.sort_values(by=['col1'])

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

#### Classificando por múltiplas colunas

In [26]:
f.sort_values(by=['col1', 'col2'])

  col1  col2  col3 col4
1    A     1     1    B
0    A     2     0    a
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

#### Classificando de formas descendente

In [27]:
f.sort_values(by='col1', ascending=False)

  col1  col2  col3 col4
4    D     7     2    e
5    C     4     3    F
2    B     9     9    c
0    A     2     0    a
1    A     1     1    B
3  NaN     8     4    D

#### Classificando colocando os NaNs para aparecer primeiro

In [28]:
f.sort_values(by='col1', ascending=False, na_position='first')

  col1  col2  col3 col4
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F
2    B     9     9    c
0    A     2     0    a
1    A     1     1    B

#### Método 1 - Adicionar uma coluna ao Dataframe do Pandas com um valor padrão.

### 2. Utilizando loc
#### Itens permitidos a atribuição
<li>Um elemento singles, como um caracter ou um numero
<li>Uma lista ou array
<li>Um fatiamento de objetos
<li> Também se pode utilizar o fatiamento do Numpy

In [29]:
# Criando dataframe de teste

students = [ ('Jack', 34, 'Sydeny' , 'Australia') ,
             ('Joshua', 30, 'Delhi' , 'India' ) ,
             ('Tom', 31, 'Mumbai' , 'India' ) ,
             ('Alicia', 32, 'Bangalore' , 'India' ) ,
             ('John', 16, 'New York' , 'US') ,
             ('Osama', 17, 'las vegas' , 'US')  ]

df = pd.DataFrame(students, 
                  columns = ['Name' , 'Age', 'City' , 'Country'], 
                  index=['a', 'b', 'c' , 'd' , 'e' , 'f'])

In [30]:
df.loc[:,'Grade'] = 'A'
df

     Name  Age       City    Country Grade
a    Jack   34     Sydeny  Australia     A
b  Joshua   30      Delhi      India     A
c     Tom   31     Mumbai      India     A
d  Alicia   32  Bangalore      India     A
e    John   16   New York         US     A
f   Osama   17  las vegas         US     A

In [31]:
#### Método 2 - Adicionar uma coluna ao Dataframe do Pandas com valores diferentes
##### Formas de fazer
1. Declarando uma lista como uma nova coluna
2. Utilizando loc (Você pode usar '.loc' com ':' para adicionar um valor especificado para todas as linhas.)
3. Utilizando .assign()
4. Utilizando .insert()
#####  Paramentros para insert
-loc: loc é um inteiro que é a localização de uma coluna onde queremos inserir uma nova coluna. Isso mudará a coluna existente naquela posição para a direita.<br>
-column: uma string que é o nome de uma coluna a ser inserida.<br>
-value: valor é simplesmente o valor a ser inserido. Pode ser um inteiro, uma string, um float ou mesmo uma série/lista de valores. Fornecer apenas um valor definirá o mesmo valor para todas as linhas.<br>
-**allow_duplicates**: é um valor booleano que verifica se uma coluna com o mesmo nome já existe ou não.

SyntaxError: invalid syntax (<ipython-input-31-cb201b0c91f9>, line 3)

In [34]:
# 2. Utilizando loc
df.loc[:, 'Final_Year'] = [2020,2021,2021,2021,2020,2018]
df

     Name  Age       City    Country Grade  Final_Year
a    Jack   34     Sydeny  Australia     A        2020
b  Joshua   30      Delhi      India     A        2021
c     Tom   31     Mumbai      India     A        2021
d  Alicia   32  Bangalore      India     A        2021
e    John   16   New York         US     A        2020
f   Osama   17  las vegas         US     A        2018

#### Removendo registros duplicados
[Método drop_duplicates](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop_duplicates.html#pandas-dataframe-drop-duplicates) Retorne DataFrame com linhas duplicadas removidas.

In [35]:
# Criando o dataset

frame_data = {'nome'  : ['Berry', 'Kara', 'Clark', 'Berry'], 
              'idade' : [28, 32, 52, 28], 
              'função': ['Office Boy', 'Enfermeira', 'Ascensorista', 'Office Boy']}

df = pd.DataFrame(frame_data)
df

    nome  idade        função
0  Berry     28    Office Boy
1   Kara     32    Enfermeira
2  Clark     52  Ascensorista
3  Berry     28    Office Boy

In [36]:
# Verificado se existem registros duplicados
df.duplicated()

0    False
1    False
2    False
3     True
dtype: bool

#### Atenção: por padrão o método drop_duplicates retorna um dataframe temporário em memória, então se quiser gerar um novo dataframe, faça uma atribuição para uma nova variável.
#### Caso você queira atualizar o dataframe atual, você deve utilizar o parâmetro inplace. (Como se fosse um commit)

In [47]:
# Se for positivo, podemos remover os duplicados utilizando o metodo
df_no_duplicates = df.drop_duplicates()
df_no_duplicates

    nome  idade        função
0  Berry     28    Office Boy
1   Kara     32    Enfermeira
2  Clark     52  Ascensorista

In [48]:
# O dataframe original continua igual
df

    nome  idade        função
0  Berry     28    Office Boy
1   Kara     32    Enfermeira
2  Clark     52  Ascensorista
3  Berry     28    Office Boy

In [49]:
# Para alterar diretamente no dataframe
df.drop_duplicates(inplace=True)

In [50]:
df

    nome  idade        função
0  Berry     28    Office Boy
1   Kara     32    Enfermeira
2  Clark     52  Ascensorista

#### Eliminar duplicidade por coluna
##### Não necessariamente é uma duplicata perfeita. (Todos os valores iguais a outro registro)

In [12]:
# Criando o dataframe

frame_data = {'nome'  : ['Berry', 'Kara', 'Clark', 'Berry'], 
              'idade' : [28, 32, 52, 27], 
              'função': ['Office Boy', 'Enfermeira', 'Ascensorista', 'Office Boy']}
df = pd.DataFrame(frame_data)
df

    nome  idade        função
0  Berry     28    Office Boy
1   Kara     32    Enfermeira
2  Clark     52  Ascensorista
3  Berry     27    Office Boy

In [52]:
# Atenção a regra do inplace. 
# Escolhe remover a última ocorrência.

df.drop_duplicates(['nome'])

    nome  idade        função
0  Berry     28    Office Boy
1   Kara     32    Enfermeira
2  Clark     52  Ascensorista

#### Excluir uma coluna
[Método Drop](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html#pandas-dataframe-drop) Remova os rótulos especificados das linhas ou colunas. Por padrão o drop remove por índice, **para remover por coluna use o parâmetro axis=1.**<br>

inplace: bool, Se for False, retorne uma cópia. Caso contrário, execute a operação no local.

In [6]:
df = pd.DataFrame(np.arange(12).reshape(3, 4),
                  columns=['A', 'B', 'C', 'D'])
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [7]:
# Apagar colunas
df.drop(['B', 'C'], axis=1)

   A   D
0  0   3
1  4   7
2  8  11

In [8]:
df.drop(columns=['B', 'C'])

   A   D
0  0   3
1  4   7
2  8  11

#### Excluir linhas

In [14]:
# Criando o dataframe

frame_data = {'nome': ['Berry', 'Kara', 'Clark'], 'idade': [28, 32, 52], 'função': ['Office Boy', 'Enfermeira', 'Ascensorista']}

df = pd.DataFrame(frame_data)
df

    nome  idade        função
0  Berry     28    Office Boy
1   Kara     32    Enfermeira
2  Clark     52  Ascensorista

In [56]:
# Deletando linhas utilizando o indice

df.drop([0])

    nome  idade        função
1   Kara     32    Enfermeira
2  Clark     52  Ascensorista

In [15]:
# Criando o dataframe

frame_data = {'nome': ['Berry', 'Kara', 'Clark'], 
              'idade': [28, 32, 52], 
              'função': ['Office Boy', 'Enfermeira', 'Ascensorista']}

df = pd.DataFrame(frame_data, index = ['Berry', 'Kara', 'Clark'])
df

        nome  idade        função
Berry  Berry     28    Office Boy
Kara    Kara     32    Enfermeira
Clark  Clark     52  Ascensorista

In [58]:
# Apagando registros utilizando o nome no indice
df.drop(['Kara'])

        nome  idade        função
Berry  Berry     28    Office Boy
Clark  Clark     52  Ascensorista

In [59]:
# Excluir um intervalo de linha
df.drop(df.index[[0,1]])

        nome  idade        função
Clark  Clark     52  Ascensorista

In [60]:
# Excluir a última linha do dataframe
df.drop(df.index[-1])

        nome  idade      função
Berry  Berry     28  Office Boy
Kara    Kara     32  Enfermeira

#### Soma de colunas
[Método Sum](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sum.html#pandas-dataframe-sum) Retorna a soma dos valores sobre o eixo solicitado.

In [17]:
# Criando o dataframe

frame_data = {'A': [23, 12, 12], 'B': [18, 18, 22], 'C': [13, 112, 13]}

df = pd.DataFrame(frame_data)
df

    A   B    C
0  23  18   13
1  12  18  112
2  12  22   13

In [18]:
df['A'].sum()

47

#### Contagem de valores únicos
[Método nunique](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.nunique.html#pandas-dataframe-nunique) Conte observações distintas sobre o **eixo** solicitado. Por padrão, é a coluna. axis = 0, ou vazio

In [19]:
# Exemplo 1
df = pd.DataFrame({'A': [1, 2, 3], 'B': [1, 1, 1]})
print(df)
df.nunique()

   A  B
0  1  1
1  2  1
2  3  1

A    3
B    1
dtype: int64

In [21]:
df.nunique(axis=1)

0    1
1    2
2    2
dtype: int64

In [5]:
print(df)

df.nunique(0)

   A  B
0  1  1
1  2  1
2  3  1

A    3
B    1
dtype: int64

In [3]:
# Exemplo 2 - Criando o dataframe

frame_data = {'A': [23, 12, 12], 'B': [18, 18, 22], 'C': [13, 112, 13]}
df = pd.DataFrame(frame_data)
df

    A   B    C
0  23  18   13
1  12  18  112
2  12  22   13

In [4]:
df['A'].nunique()

2

In [66]:
# Para contar todos os valores em uma coluna, use o método count
df['A'].count()

3

In [ ]:
#### Subconjunto de linhas

In [37]:
# lendo arquivo csv
data_path = 'C:\\Users\\anton\\OneDrive\\Documentos\\Treinamento Cientista de Dados\\Python Aplicado a Big Data\\Aula 3 - 08032021 - Pandas\\sample-data\\csv\\'

data = pd.read_csv(data_path+'netflix_titles.csv')

In [38]:
# Visualizando os primeiros registros
data.head()

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,s1,TV Show,3%,NaN,"João Miguel, Bianca Comparato, Michel Gomes, R...",Brazil,"August 14, 2020",2020,TV-MA,4 Seasons,"International TV Shows, TV Dramas, TV Sci-Fi &...",In a future where the elite inhabit an island ...
1,s2,Movie,7:19,Jorge Michel Grau,"Demián Bichir, Héctor Bonilla, Oscar Serrano, ...",Mexico,"December 23, 2016",2016,TV-MA,93 min,"Dramas, International Movies",After a devastating earthquake hits Mexico Cit...
2,s3,Movie,23:59,Gilbert Chan,"Tedd Chan, Stella Chung, Henley Hii, Lawrence ...",Singapore,"December 20, 2018",2011,R,78 min,"Horror Movies, International Movies","When an army recruit is found dead, his fellow..."
3,s4,Movie,9,Shane Acker,"Elijah Wood, John C. Reilly, Jennifer Connelly...",United States,"November 16, 2017",2009,PG-13,80 min,"Action & Adventure, Independent Movies, Sci-Fi...","In a postapocalyptic world, rag-doll robots hi..."
4,s5,Movie,21,Robert Luketic,"Jim Sturgess, Kevin Spacey, Kate Bosworth, Aar...",United States,"January 1, 2020",2008,PG-13,123 min,Dramas,A brilliant group of students become card-coun...

In [12]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7787 entries, 0 to 7786
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       7787 non-null   object
 1   type          7787 non-null   object
 2   title         7787 non-null   object
 3   director      5398 non-null   object
 4   cast          7069 non-null   object
 5   country       7280 non-null   object
 6   date_added    7777 non-null   object
 7   release_year  7787 non-null   int64
 8   rating        7780 non-null   object
 9   duration      7787 non-null   object
 10  listed_in     7787 non-null   object
 11  description   7787 non-null   object
dtypes: int64(1), object(11)
memory usage: 730.2+ KB

In [39]:
data.describe(include='all') # Informa as colunas do dataset e dados a respeito delas

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
count,7787,7787,7787,5398,7069,7280,7777,7787.000000,7780,7787,7787,7787
unique,7787,2,7787,4049,6831,681,1565,NaN,14,216,492,7769
top,s264,Movie,Kurbaan,"Raúl Campos, Jan Suter",David Attenborough,United States,"January 1, 2020",NaN,TV-MA,1 Season,Documentaries,A surly septuagenarian gets another chance at ...
freq,1,5377,1,18,18,2555,118,NaN,2863,1608,334,3
mean,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2013.932580,NaN,NaN,NaN,NaN
std,NaN,NaN,NaN,NaN,NaN,NaN,NaN,8.757395,NaN,NaN,NaN,NaN
min,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1925.000000,NaN,NaN,NaN,NaN
25%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2013.000000,NaN,NaN,NaN,NaN
50%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2017.000000,NaN,NaN,NaN,NaN
75%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2018.000000,NaN,NaN,NaN,NaN
max,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2021.000000,NaN,NaN,NaN,NaN

In [40]:
data.describe()

       release_year
count   7787.000000
mean    2013.932580
std        8.757395
min     1925.000000
25%     2013.000000
50%     2017.000000
75%     2018.000000
max     2021.000000

In [18]:
# Fatiando os registros e retornando todas as colunas
data[16:700]

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
16,s17,TV Show,Feb-09,NaN,"Shahd El Yaseen, Shaila Sabt, Hala, Hanadi Al-...",NaN,"March 20, 2019",2018,TV-14,1 Season,"International TV Shows, TV Dramas","As a psychology professor faces Alzheimer's, h..."
17,s18,Movie,22-Jul,Paul Greengrass,"Anders Danielsen Lie, Jon Øigarden, Jonas Stra...","Norway, Iceland, United States","October 10, 2018",2018,R,144 min,"Dramas, Thrillers","After devastating terror attacks in Norway, a ..."
18,s19,Movie,15-Aug,Swapnaneel Jayakar,"Rahul Pethe, Mrunmayee Deshpande, Adinath Koth...",India,"March 29, 2019",2019,TV-14,124 min,"Comedies, Dramas, Independent Movies","On India's Independence Day, a zany mishap in ..."
19,s20,Movie,'89,NaN,"Lee Dixon, Ian Wright, Paul Merson",United Kingdom,"May 16, 2018",2017,TV-PG,87 min,Sports Movies,"Mixing old footage with interviews, this is th..."
20,s21,Movie,​​Kuch Bheege Alfaaz,Onir,"Geetanjali Thapa, Zain Khan Durrani, Shray Rai...",India,"September 1, 2018",2018,TV-14,110 min,"Dramas, Independent Movies, International Movies",After accidentally connecting over the Interne...
...,...,...,...,...,...,...,...,...,...,...,...,...
695,s696,Movie,Bad Match,David Chirchirillo,"Jack Cutmore-Scott, Lili Simmons, Brandon Scot...","Singapore, United States","March 11, 2018",2017,TV-MA,83 min,Thrillers,A player who uses the internet to facilitate h...
696,s697,Movie,Bad Rap,Salima Koroma,"Jonathan Park, Awkwafina, David Lee, Richard Lee","United States, Canada","August 21, 2017",2016,TV-MA,83 min,"Documentaries, Music & Musicals",Four young Asian-American rappers strive to ac...
697,s698,Movie,Bad Seeds,Kheiron,"Kheiron, Catherine Deneuve, André Dussollier, ...","France, Belgium","December 21, 2018",2018,TV-MA,105 min,"Comedies, Dramas, International Movies","Troubled by his past, a scam artist who runs a..."
698,s699,TV Show,Badalte Rishton Ki Dastaan,NaN,"Additi Gupta, Sanjeeda Sheikh, Kiran Karmarkar...",India,"April 1, 2017",2013,TV-14,1 Season,"International TV Shows, TV Dramas","When a man is killed, his wife and his lover –..."
699,s700,Movie,Badha,"Sumitra Bhave, Sunil Sukthankar","Amruta Subhash, Rajesh More, Devika Daftardar,...",India,"January 1, 2018",2006,TV-14,91 min,"Dramas, International Movies",A young woman who is suspected of practicing b...

In [21]:
# Retornando 1 coluna e fatiando
data['title'][16:700]

16                         Feb-09
17                         22-Jul
18                         15-Aug
19                            '89
20           ​​Kuch Bheege Alfaaz
                  ...
695                     Bad Match
696                       Bad Rap
697                     Bad Seeds
698    Badalte Rishton Ki Dastaan
699                         Badha
Name: title, Length: 684, dtype: object

In [10]:
# Retornando 2 colunas e fatiando
sliced_df = data[['title','director']][100:900]
print("Tipo: ", type(sliced_df))
sliced_df

Tipo:  <class 'pandas.core.frame.DataFrame'>

                              title         director
100                        3 Idiots  Rajkumar Hirani
101               3 Seconds Divorce     Shazia Javed
102             3 Türken & ein Baby      Sinan Akkuş
103               30 Days of Luxury       Hani Hamdi
104              30 Minutes or Less  Ruben Fleischer
..                              ...              ...
895                  Bibi & Tina II      Detlev Buck
896  Bibi & Tina: Girls Versus Boys      Detlev Buck
897   Bibi & Tina: Tohuwabohu Total      Detlev Buck
898                   Bibik-Bibikku              NaN
899             Big Bad Beetleborgs              NaN

[800 rows x 2 columns]